; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=4, packages=9, locations=12, density=1.0, fully_connected=True, max_capacity=2, out_folder=./fully/training, instance_id=20, seed=61

(define (problem transport-20)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l6)
    (at p3 l12)
    (at p4 l1)
    (at p5 l8)
    (at p6 l6)
    (at p7 l6)
    (at p8 l2)
    (at p9 l7)
    (at v1 l8)
    (at v2 l6)
    (at v3 l3)
    (at v4 l6)
    )
 (:goal  (and 
    (at p1 l11)
    (at p2 l1)
    (at p3 l9)
    (at p4 l12)
    (at p5 l2)
    (at p6 l11)
    (at p7 l3)
    (at p8 l6)
    (at p9 l1))))

; plan
1. (drive v4 l6 l1)
   deleted: (at v4 l6)
   added: (at v4 l1)
   goals met: 0 of 9
2. (pick-up v4 l1 p4 c1 c2)
   deleted: (at p4 l1) (capacity v4 c2)
   added: (in p4 v4) (capacity v4 c1)
   goals met: 0 of 9
3. (drive v4 l1 l12)
   deleted: (at v4 l1)
   added: (at v4 l12)
   goals met: 0 of 9
4. (pick-up v4 l12 p3 c0 c1)
   deleted: (at p3 l12) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 0 of 9
5. (drop v4 l12 p4 c0 c1)
   deleted: (in p4 v4) (capacity v4 c0)
   added: (at p4 l12) (capacity v4 c1)
   goals met: 1 of 9
6. (drive v4 l12 l9)
   deleted: (at v4 l12)
   added: (at v4 l9)
   goals met: 1 of 9
7. (drop v4 l9 p3 c1 c2)
   deleted: (in p3 v4) (capacity v4 c1)
   added: (at p3 l9) (capacity v4 c2)
   goals met: 2 of 9
8. (drive v2 l6 l1)
   deleted: (at v2 l6)
   added: (at v2 l1)
   goals met: 2 of 9
9. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 2 of 9
10. (pick-up v1 l2 p8 c1 c2)
   deleted: (at p8 l2) (capacity v1 c2)
   added: (in p8 v1) (capacity v1 c1)
   goals met: 2 of 9
11. (drive v2 l1 l7)
   deleted: (at v2 l1)
   added: (at v2 l7)
   goals met: 2 of 9
12. (pick-up v2 l7 p9 c0 c1)
   deleted: (at p9 l7) (capacity v2 c1)
   added: (in p9 v2) (capacity v2 c0)
   goals met: 2 of 9
13. (drive v2 l7 l1)
   deleted: (at v2 l7)
   added: (at v2 l1)
   goals met: 2 of 9
14. (drop v2 l1 p9 c0 c1)
   deleted: (in p9 v2) (capacity v2 c0)
   added: (at p9 l1) (capacity v2 c1)
   goals met: 3 of 9
15. (drive v3 l3 l6)
   deleted: (at v3 l3)
   added: (at v3 l6)
   goals met: 3 of 9
16. (drive v3 l6 l11)
   deleted: (at v3 l6)
   added: (at v3 l11)
   goals met: 3 of 9
17. (drive v3 l11 l5)
   deleted: (at v3 l11)
   added: (at v3 l5)
   goals met: 3 of 9
18. (pick-up v3 l5 p1 c0 c1)
   deleted: (at p1 l5) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 3 of 9
19. (drive v3 l5 l11)
   deleted: (at v3 l5)
   added: (at v3 l11)
   goals met: 3 of 9
20. (drop v3 l11 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l11) (capacity v3 c1)
   goals met: 4 of 9
21. (drive v3 l11 l6)
   deleted: (at v3 l11)
   added: (at v3 l6)
   goals met: 4 of 9
22. (pick-up v3 l6 p2 c0 c1)
   deleted: (at p2 l6) (capacity v3 c1)
   added: (in p2 v3) (capacity v3 c0)
   goals met: 4 of 9
23. (drive v3 l6 l1)
   deleted: (at v3 l6)
   added: (at v3 l1)
   goals met: 4 of 9
24. (drop v3 l1 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l1) (capacity v3 c1)
   goals met: 5 of 9
25. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 5 of 9
26. (pick-up v1 l6 p6 c0 c1)
   deleted: (at p6 l6) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 9
27. (drive v2 l1 l2)
   deleted: (at v2 l1)
   added: (at v2 l2)
   goals met: 5 of 9
28. (drive v1 l6 l11)
   deleted: (at v1 l6)
   added: (at v1 l11)
   goals met: 5 of 9
29. (drop v1 l11 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l11) (capacity v1 c1)
   goals met: 6 of 9
30. (drive v1 l11 l3)
   deleted: (at v1 l11)
   added: (at v1 l3)
   goals met: 6 of 9
31. (drive v2 l2 l8)
   deleted: (at v2 l2)
   added: (at v2 l8)
   goals met: 6 of 9
32. (pick-up v2 l8 p5 c0 c1)
   deleted: (at p5 l8) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 6 of 9
33. (drive v2 l8 l2)
   deleted: (at v2 l8)
   added: (at v2 l2)
   goals met: 6 of 9
34. (drop v2 l2 p5 c0 c1)
   deleted: (in p5 v2) (capacity v2 c0)
   added: (at p5 l2) (capacity v2 c1)
   goals met: 7 of 9
35. (drive v1 l3 l6)
   deleted: (at v1 l3)
   added: (at v1 l6)
   goals met: 7 of 9
36. (pick-up v1 l6 p7 c0 c1)
   deleted: (at p7 l6) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 7 of 9
37. (drop v1 l6 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l6) (capacity v1 c1)
   goals met: 8 of 9
38. (drive v1 l6 l3)
   deleted: (at v1 l6)
   added: (at v1 l3)
   goals met: 8 of 9
39. (drop v1 l3 p7 c1 c2)
   deleted: (in p7 v1) (capacity v1 c1)
   added: (at p7 l3) (capacity v1 c2)
   goals met: 9 of 9
